Revit 2027 API
PropertyLine.GetStart Method
 Gets the start point of the PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetStart()
Public Function GetStart As XYZ
public:
XYZ^ GetStart()
member GetStart : unit -> XYZ
Return Value
XYZ
 The start point's coordinates.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace